Тест_ЗУП_31_КОРП/src/InformationRegisters/МестаВыплатыЗарплатыСотрудников/МестаВыплатыЗарплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МестаВыплатыЗарплатыСотрудников</name>
  <resources>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидыМестВыплатыЗарплаты</types>
    </type>
  </resources>
  <resources>
    <name>МестоВыплаты</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
      <types>CatalogRef.ЗарплатныеПроекты</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест_ЗУП_31_КОРП/src/InformationRegisters/МестаВыплатыЗарплатыСотрудников/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает допустимые значения видов мест выплаты зарплаты сотрудников.
//
// Возвращаемое значение:
//	Массив элементов типа ПеречислениеСсылка.ВидыМестВыплатыЗарплаты.
//
Функция ДопустимыеВидыМестВыплаты() Экспорт
	
	Возврат Перечисления.ВидыМестВыплатыЗарплаты.ВсеЗначения()
	
КонецФункции	

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

// Заполняет измерение ФизическоеЛицо
//
Процедура ЗаполнитьФизическоеЛицо() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МестаВыплаты.Сотрудник КАК Сотрудник,
	|	МестаВыплаты.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо
	|ИЗ
	|	РегистрСведений.МестаВыплатыЗарплатыСотрудников КАК МестаВыплаты
	|ГДЕ
	|	МестаВыплаты.ФизическоеЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	МестаВыплаты.Сотрудник.ФизическоеЛицо,
	|	МестаВыплаты.Сотрудник";
	
	ВыборкаСотрудников = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаСотрудников.Следующий() Цикл
		
		МестаВыплатыЗарплатыСотрудников = СоздатьМенеджерЗаписи();
		МестаВыплатыЗарплатыСотрудников.Сотрудник = ВыборкаСотрудников.Сотрудник;
	
		МестаВыплатыЗарплатыСотрудников.Прочитать();
	
		Если НЕ МестаВыплатыЗарплатыСотрудников.Выбран() Тогда
			МестаВыплатыЗарплатыСотрудников.Сотрудник = ВыборкаСотрудников.Сотрудник;
		КонецЕсли;	
		
		МестаВыплатыЗарплатыСотрудников.ФизическоеЛицо = ВыборкаСотрудников.ФизическоеЛицо;
		
		МестаВыплатыЗарплатыСотрудников.Записать();
		
	КонецЦикла
	
КонецПроцедуры	

#КонецОбласти

#КонецОбласти

#КонецЕсли
